###############################################
# tap: Homebrew に正式に登録されていないライブラリをインストールできる
tap "aquasecurity/trivy"
tap "aws/tap"
tap "homebrew/bundle"
tap "mas-cli/tap"
tap "weaveworks/tap"
###############################################
# brew: インストールしたいライブラリを記述
brew "argocd"
brew "coreutils"
brew "asdf"
brew "awscli"
brew "curl"
brew "fzf"
brew "ghq"
brew "git"
brew "gnu-sed"
brew "helm"
brew "helmfile"
brew "jq"
brew "kind"
brew "pre-commit"
brew "tetra"
brew "terraform-docs"
brew "terraform-landscape"
brew "tfenv"
brew "tflint"
brew "tfsec"
brew "tree"
brew "watch"
brew "wget"
brew "yq"
brew "zsh"
brew "aquasecurity/trivy/trivy"
brew "aws/tap/copilot-cli"
brew "mas-cli/tap/mas"
brew "weaveworks/tap/eksctl"
###############################################
# cake: インストールしたいGUIアプリケーションを記述
cask "google-cloud-sdk"
cask "sequel-ace"
################################################
# 'vscode --install-extension'
vscode "4ops.terraform"
vscode "akamud.vscode-theme-onedark"
vscode "aliariff.slim-lint"
vscode "amazonwebservices.aws-toolkit-vscode"
vscode "aws-scripting-guy.cform"
vscode "castwide.solargraph"
vscode "chris-hayes.chatgpt-reborn"
vscode "christian-kohler.npm-intellisense"
vscode "christian-kohler.path-intellisense"
vscode "dbaeumer.vscode-eslint"
vscode "donjayamanne.githistory"
vscode "eamodio.gitlens"
vscode "ecmel.vscode-html-css"
vscode "esbenp.prettier-vscode"
vscode "figma.figma-vscode-extension"
vscode "formulahendry.auto-close-tag"
vscode "formulahendry.auto-rename-tag"
vscode "foxundermoon.shell-format"
vscode "GitHub.copilot"
vscode "GitHub.copilot-chat"
vscode "GitHub.copilot-labs"
vscode "GitHub.vscode-pull-request-github"
vscode "googlecloudtools.cloudcode"
vscode "hashicorp.terraform"
vscode "hediet.vscode-drawio"
vscode "kaiwood.endwise"
vscode "mechatroner.rainbow-csv"
vscode "mindaro-dev.file-downloader"
vscode "mindaro.mindaro"
vscode "misogi.ruby-rubocop"
vscode "mosapride.zenkaku"
vscode "ms-azuretools.vscode-docker"
vscode "MS-CEINTL.vscode-language-pack-ja"
vscode "ms-kubernetes-tools.vscode-kubernetes-tools"
vscode "ms-python.python"
vscode "ms-python.vscode-pylance"
vscode "ms-vscode-remote.remote-containers"
vscode "ms-vscode-remote.remote-ssh"
vscode "ms-vscode-remote.remote-ssh-edit"
vscode "ms-vscode-remote.remote-wsl"
vscode "ms-vscode-remote.vscode-remote-extensionpack"
vscode "ms-vscode.remote-explorer"
vscode "ms-vscode.remote-server"
vscode "oderwat.indent-rainbow"
vscode "PKief.material-icon-theme"
vscode "pnp.polacode"
vscode "rebornix.ruby"
vscode "redhat.vscode-yaml"
vscode "sianglim.slim"
vscode "streetsidesoftware.code-spell-checker"
vscode "vscode-icons-team.vscode-icons"
vscode "Vue.volar"
vscode "wingrunr21.vscode-ruby"
vscode "yoavbls.pretty-ts-errors"
vscode "yzhang.markdown-all-in-one"
vscode "Zignd.html-css-class-completion"
