tap "aquaproj/aqua"
tap "aquasecurity/trivy"
tap "argoproj/tap"
tap "aws/tap"
tap "homebrew/bundle"
tap "mas-cli/tap"
tap "rcmdnk/file"
tap "weaveworks/tap"
brew "argocd"
brew "coreutils"
brew "asdf"
brew "pycparser"
brew "cffi"
brew "awscli"
brew "colordiff"
brew "curl"
brew "docutils"
brew "fzf"
brew "ghq"
brew "git"
brew "grep"
brew "gnu-sed"
brew "helm"
brew "helmfile"
brew "jq"
brew "k6"
brew "kind"
brew "krew"
brew "minikube"
brew "mise"
brew "sheldon"
brew "starship"
brew "telnet"
brew "terraform-docs"
brew "tetra"
brew "tflint"
brew "tfsec"
brew "tree"
brew "virtualenv"
brew "watch"
brew "wget"
brew "yq"
brew "zsh"
brew "aquaproj/aqua/aqua"
brew "aquasecurity/trivy/trivy"
brew "argoproj/tap/kubectl-argo-rollouts"
brew "derailed/k9s/k9s"
brew "mas-cli/tap/mas"
brew "rcmdnk/file/brew-file"
brew "weaveworks/tap/eksctl"
cask "arc"
# cask "anki"
cask "clipy"
cask "discord"
# cask "docker"
cask "google-cloud-sdk"
cask "hammerspoon"
cask "logi-options+"
# cask "sequel-ace"
# cask "spotify"
cask "visual-studio-code"
cask "wezterm"
# cask "zoom"   
# mas "Focus To-Do", id: 1258530160
# mas "GarageBand", id: 682658836
# mas "iMovie", id: 408981434
# mas "Keynote", id: 409183694
# mas "Kindle", id: 302584613
# mas "Microsoft Word", id: 462054704
# mas "Numbers", id: 409203825
# mas "Pages", id: 409201541
vscode "akamud.vscode-theme-onedark"
vscode "amazonwebservices.aws-toolkit-vscode"
vscode "benjaminbenais.copilot-theme"
vscode "castwide.solargraph"
vscode "christian-kohler.npm-intellisense"
vscode "christian-kohler.path-intellisense"
vscode "dbaeumer.vscode-eslint"
vscode "donjayamanne.githistory"
vscode "eamodio.gitlens"
vscode "ecmel.vscode-html-css"
vscode "esbenp.prettier-vscode"
vscode "formulahendry.auto-close-tag"
vscode "formulahendry.auto-rename-tag"
vscode "foxundermoon.shell-format"
vscode "github.copilot"
vscode "github.copilot-chat"
vscode "github.vscode-github-actions"
vscode "github.vscode-pull-request-github"
vscode "golang.go"
vscode "googlecloudtools.cloudcode"
vscode "hashicorp.terraform"
vscode "hediet.vscode-drawio"
vscode "kaiwood.endwise"
vscode "mechatroner.rainbow-csv"
vscode "mindaro-dev.file-downloader"
vscode "mindaro.mindaro"
vscode "misogi.ruby-rubocop"
vscode "mosapride.zenkaku"
vscode "mrmlnc.vscode-json5"
vscode "ms-azuretools.vscode-docker"
vscode "ms-ceintl.vscode-language-pack-ja"
vscode "ms-kubernetes-tools.vscode-kubernetes-tools"
vscode "ms-python.debugpy"
vscode "ms-python.python"
vscode "ms-vscode-remote.remote-containers"
vscode "ms-vscode-remote.remote-ssh"
vscode "ms-vscode-remote.remote-ssh-edit"
vscode "ms-vscode-remote.remote-wsl"
vscode "ms-vscode-remote.vscode-remote-extensionpack"
vscode "ms-vscode.makefile-tools"
vscode "ms-vscode.remote-explorer"
vscode "ms-vscode.remote-server"
vscode "mushan.vscode-paste-image"
vscode "negokaz.zenn-editor"
vscode "oderwat.indent-rainbow"
vscode "pkief.material-icon-theme"
vscode "pnp.polacode"
vscode "redhat.vscode-yaml"
vscode "streetsidesoftware.code-spell-checker"
vscode "tomoki1207.pdf"
vscode "tamasfe.even-better-toml"
vscode "timonwong.shellcheck"
vscode "vscode-icons-team.vscode-icons"
vscode "yoavbls.pretty-ts-errors"
vscode "yzhang.markdown-all-in-one"
vscode "zignd.html-css-class-completion"
vscode "zenn.zenn-preview"